burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Source/gd32w51x_f5hc_qspi.c
/*!
    \file    gd32w51x_f5hc_qspi.c
    \brief   QSPI driver

    \version 2026-04-15, V2.0.0, firmware for gd32w51x_f5hc
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.


    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32w51x_f5hc_qspi.h"

/* QSPI timeout */
#define QSPI_TOMEOUT    ((uint16_t)0xFFFFU)                  /*!< command config timeout */

/* configure QSPI functionalmode */
static void qspi_config(qspi_command_struct *cmd, uint32_t functionalmode);

/*!
    \brief      reset QSPI (API_ID(0x0001U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void qspi_deinit(void)
{
    rcu_periph_reset_enable(RCU_QSPIRST);
    rcu_periph_reset_disable(RCU_QSPIRST);
}

/*!
    \brief      initialize the parameters of QSPI struct with the default values (API_ID(0x0002U))
    \param[in]  qspi_struct: QSPI parameter stuct
    \param[out] none
    \retval     none
*/
void qspi_init_struct_para_init(qspi_init_struct *qspi_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(qspi_struct)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x0002U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* set the QSPI struct with the default values */
        qspi_struct->clock_mode = QSPI_CLOCK_SCK_LOW;
        qspi_struct->prescaler = 0x03U;
        qspi_struct->fifo_threshold = 0x10U;
        qspi_struct->sample_shift = QSPI_SAMPLE_SHIFTING_NONE;
        qspi_struct->flash_size = 0x1FU;
        qspi_struct->cs_high_time = QSPI_CS_HIGH_TIME_1_CYCLE;
    }
}

/*!
    \brief      initialize QSPI parameter (API_ID(0x0003U))
    \param[in]  qspi_struct: QSPI parameter initialization stuct members of the structure
                            and the member values are shown as below:
                  clockmode: QSPI_CLOCK_MODE_0, QSPI_CLOCK_MODE_3
                  fifothreshold: between 1 and 16
                  sampleshift: QSPI_SAMPLE_SHIFTING_NONE, QSPI_SAMPLE_SHIFTING_HALFCYCLE, QSPI_SAMPLE_SHIFTING_ONECYCLE
                  flashsize: between 0 and 28
                  chipselecthightime: QSPI_CS_HIGH_TIME_1_CYCLE, QSPI_CS_HIGH_TIME_2_CYCLE, QSPI_CS_HIGH_TIME_3_CYCLE,
                                      QSPI_CS_HIGH_TIME_4_CYCLE, QSPI_CS_HIGH_TIME_5_CYCLE, QSPI_CS_HIGH_TIME_6_CYCLE,
                                      QSPI_CS_HIGH_TIME_7_CYCLE, QSPI_CS_HIGH_TIME_8_CYCLE
                  prescale: between 0 and 255
    \param[out] none
    \retval     none
    \note       This function may contain scenarios leading to an infinite loop.
                Modify it according to the actual usage requirements.
*/
void qspi_init(qspi_init_struct *qspi_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(qspi_struct)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x0003U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t reg = 0U;
        uint16_t qtimeout = QSPI_TOMEOUT;

        reg = QSPI_CTL;
        reg &= ~(QSPI_CTL);
        reg |= ((qspi_struct->fifo_threshold - 1U) << 8);
        QSPI_CTL = reg;
        /* wait till BUSY flag reset */
        while(((QSPI_CTL & QSPI_CTL_BUSY) != 0U) && (--qtimeout > 0U)) {
        }

        /* configure prescaler, sampleshift */
        reg = QSPI_CTL;
        reg &= ~((QSPI_CTL_PSC) | QSPI_SAMPLE_SHIFTING_HALFCYCLE);
        reg |= (qspi_struct->prescaler << 24) | qspi_struct->sample_shift;
        QSPI_CTL = reg;

        /* configure flashsize, chipselecthightime, clockmode */
        reg = QSPI_DCFG;
        reg &= ~((QSPI_DCFG_FMSZ) | QSPI_CS_HIGH_TIME_8_CYCLE | QSPI_DCFG_CKMOD);
        reg |= ((qspi_struct->flash_size << 16) | qspi_struct->cs_high_time | qspi_struct->clock_mode);
        QSPI_DCFG = reg;

        QSPI_CTL  |= QSPI_CTL_QSPIEN;
        QSPI_STAT |= QSPI_STAT_TERRIE;
    }
}
/*!
    \brief      enable QSPI (API_ID(0x0004U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void qspi_enable(void)
{
    QSPI_CTL |= (uint32_t)QSPI_CTL_QSPIEN;
}

/*!
    \brief      disable QSPI (API_ID(0x0005U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void qspi_disable(void)
{
    QSPI_CTL &= ~(uint32_t)QSPI_CTL_QSPIEN;
}

/*!
    \brief      enable QSPI DMA (API_ID(0x0006U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void qspi_dma_enable(void)
{
    QSPI_STAT |= (uint32_t)(QSPI_STAT_DMAEN);
}

/*!
    \brief      disable QSPI DMA (API_ID(0x0007U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void qspi_dma_disable(void)
{
    QSPI_STAT &= ~(uint32_t)QSPI_STAT_DMAEN;
}

/*!
    \brief      configure QSPI data length
    \param[in]  dtlen: 1 ~ 4294967295 (4G-1)
                Please note that when using this function, the parameter passed in is the actual number of data bytes to be transmitted.
    \param[out] none
    \retval     none
*/
void qspi_data_length_config(uint32_t dtlen)
{
    if(dtlen >= 1U){
        QSPI_DTLEN = (dtlen - 1U);
    } else {
        /* do nothing */
    }
}

/*!
    \brief      QSPI command parameter (API_ID(0x0009U))
    \param[in]  cmd: QSPI command parameter initialization stuct members of the structure
                             and the member values are shown as below:
                  instruction: reference flash commands description
                  address: 0-flash size
                  alternatebytes: 0-0xFFFFFFFF
                  addresssize: QSPI_ADDR_8_BITS, QSPI_ADDR_16_BITS, QSPI_ADDR_24_BITS, QSPI_ADDR_32_BITS
                  alternatebytessize: QSPI_ALTE_BYTES_8_BITS, QSPI_ALTE_BYTES_16_BITS,
                                      QSPI_ALTE_BYTES_24_BITS, QSPI_ALTE_BYTES_32_BITS
                  dummycycles: between 0 and 31
                  instructionmode: QSPI_INSTRUCTION_NONE, QSPI_INSTRUCTION_1_LINE,
                                   QSPI_INSTRUCTION_2_LINES, QSPI_INSTRUCTION_4_LINES
                  addressmode: QSPI_ADDR_NONE, QSPI_ADDR_1_LINE, QSPI_ADDR_2_LINES, QSPI_ADDR_4_LINES
                  alternatebytemode: QSPI_ALTE_BYTES_NONE, QSPI_ALTE_BYTES_1_LINE,
                                     QSPI_ALTE_BYTES_2_LINES, QSPI_ALTE_BYTES_4_LINES
                  datamode: QSPI_DATA_NONE, QSPI_DATA_1_LINE, QSPI_DATA_2_LINES, QSPI_DATA_4_LINES
                  nbdata: 0-0xFFFFFFFF
                  sioomode: QSPI_SIOO_INST_EVERY_CMD, QSPI_SIOO_INST_ONLY_FIRST_CMD
    \param[out] none
    \retval     none
    \note       This function may contain scenarios leading to an infinite loop.
                Modify it according to the actual usage requirements.
*/
void qspi_command(qspi_command_struct *cmd)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(cmd)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x0009U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint16_t qtimeout = QSPI_TOMEOUT;

        while(((QSPI_CTL & QSPI_FLAG_BUSY) != 0U) && (--qtimeout > 0U)) {
        }

