burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Source/gd32w51x_f5hc_qspi.c
        /* call the configuration function */
        qspi_config(cmd, QSPI_INDIRECT_WRITE);

        if(cmd->data_mode == QSPI_DATA_NONE) {
            /* when there is no data phase, the transfer start as soon as the configuration is done
            so wait until TC flag is set to go back in idle state */
            while(((QSPI_STAT & QSPI_FLAG_TC) == 0U) && (--qtimeout > 0U)) {
            }
            QSPI_STATC = QSPI_STATC_TCC;
        }
    }
}

/*!
    \brief      QSPI transmit data (API_ID(0x000AU))
    \param[in]  tdata: 8-bit data
    \param[out] none
    \retval     none
    \note       This function may contain scenarios leading to an infinite loop.
                Modify it according to the actual usage requirements.
*/
void qspi_transmit(uint8_t tdata[])
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(tdata)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000AU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t TxCounter;
        uint32_t data_index = 0U;
        uint16_t qtimeout = QSPI_TOMEOUT;

        TxCounter = QSPI_DTLEN + 1U;

        QSPI_TCFG = (QSPI_TCFG & ~QSPI_MEMORY_MAPPED) | QSPI_INDIRECT_WRITE;

        while(TxCounter > 0U) {
            while(((QSPI_STAT & QSPI_FLAG_FT) == 0U) && (--qtimeout > 0U)) {
            }
            *(uint8_t *)(QSPI + 0x00000020U) = tdata[data_index];
            data_index++;
            TxCounter--;
        }
        while(((QSPI_STAT & QSPI_FLAG_TC) == 0U) && (--qtimeout > 0U)) {
        }
        QSPI_STATC = QSPI_STATC_TCC;
    }
}

/*!
    \brief      QSPI receive data (API_ID(0x000BU))
    \param[in]  rdata: empty array
    \param[out] 8-bit data array
    \retval     none
    \note       This function may contain scenarios leading to an infinite loop.
                Modify it according to the actual usage requirements.
*/
void qspi_receive(uint8_t rdata[])
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(rdata)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000BU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t RxCounter, addr;
        uint32_t data_index = 0U;
        uint16_t qtimeout = QSPI_TOMEOUT;

        RxCounter = QSPI_DTLEN + 1U;
        addr = QSPI_ADDR;

        QSPI_TCFG = (QSPI_TCFG & ~QSPI_MEMORY_MAPPED) | QSPI_INDIRECT_READ;
        /* start the transfer by re-writing the address in ADDR register */
        QSPI_ADDR = addr;

        while(RxCounter > 0U) {
            while(((QSPI_STAT & (QSPI_FLAG_FT | QSPI_FLAG_TC)) == 0U) && (--qtimeout > 0U)) {
            }
            rdata[data_index] = *(uint8_t *)(QSPI + 0x00000020U);
            data_index++;
            RxCounter--;
        }
        while(((QSPI_STAT & QSPI_FLAG_TC) == 0U) && (--qtimeout > 0U)) {
        }
        QSPI_STATC = QSPI_STATC_TCC;
    }
}

/*!
    \brief      configure QSPI autopolling mode (API_ID(0x000CU))
    \param[in]  cmd: QSPI command parameter initialization stuct members of the structure
                             and the member values are shown as below:
                  instruction: reference flash commands description
                  address: 0-flash size
                  alternatebytes: 0-0xFFFFFFFF
                  addresssize: QSPI_ADDR_8_BITS, QSPI_ADDR_16_BITS, QSPI_ADDR_24_BITS, QSPI_ADDR_32_BITS
                  alternatebytessize: QSPI_ALTE_BYTES_8_BITS, QSPI_ALTE_BYTES_16_BITS,
                                      QSPI_ALTE_BYTES_24_BITS, QSPI_ALTE_BYTES_32_BITS
                  dummycycles: between 0 and 31
                  instructionmode: QSPI_INSTRUCTION_NONE, QSPI_INSTRUCTION_1_LINE,
                                   QSPI_INSTRUCTION_2_LINES, QSPI_INSTRUCTION_4_LINES
                  addressmode: QSPI_ADDR_NONE, QSPI_ADDR_1_LINE, QSPI_ADDR_2_LINES, QSPI_ADDR_4_LINES
                  alternatebytemode: QSPI_ALTE_BYTES_NONE, QSPI_ALTE_BYTES_1_LINE,
                                     QSPI_ALTE_BYTES_2_LINES, QSPI_ALTE_BYTES_4_LINES
                  datamode: QSPI_DATA_NONE, QSPI_DATA_1_LINE, QSPI_DATA_2_LINES, QSPI_DATA_4_LINES
                  nbdata: 0-0xFFFFFFFF
                  sioomode: QSPI_SIOO_INST_EVERY_CMD, QSPI_SIOO_INST_ONLY_FIRST_CMD
    \param[in]  cfg: autopolling struct initialization stuct members of the structure
                             and the member values are shown as below:
                  match: between 0 and 0xFFFFFFFF
                  mask: between 0 and 0xFFFFFFFF
                  interval: between 0 and 0xFFFF
                  statusbytes_size: between 1 and 4
                  match_mode: QSPI_MATCH_MODE_AND, QSPI_MATCH_MODE_OR
                  auto_stop: QSPI_AUTO_STOP_DISABLE, QSPI_AUTO_STOP_ENABLE
    \param[out] none
    \retval     none
    \note       This function may contain scenarios leading to an infinite loop.
                Modify it according to the actual usage requirements.
*/
void qspi_autopolling(qspi_command_struct *cmd, qspi_autopolling_struct *cfg)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(cmd)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000CU), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(cfg)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000CU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint16_t qtimeout = QSPI_TOMEOUT;

        /* wait till BUSY flag reset */
        while(((QSPI_CTL & QSPI_FLAG_BUSY) != 0U) && (--qtimeout > 0U)) {
        }
        QSPI_STATMATCH = cfg->match;
        QSPI_STATMK = cfg->mask;
        QSPI_INTERVAL = cfg->interval;
        QSPI_CTL = (QSPI_CTL & (~(QSPI_CTL_SPS | QSPI_CTL_SPMOD))) | (cfg->match_mode | cfg->auto_stop);
        cmd->data_length = cfg->statusbytes_size;
        qspi_config(cmd, QSPI_AUTO_POLLING);

        while(((QSPI_STAT & QSPI_FLAG_SM) == 0U) && (--qtimeout > 0U)) {
        }
        QSPI_STATC = QSPI_STATC_SMC;
    }
}

/*!
    \brief      configure QSPI memorymapped mode (API_ID(0x000DU))
    \param[in]  cmd: QSPI command parameter initialization stuct members of the structure
                             and the member values are shown as below:
                  instruction: reference flash commands description
                  address: 0-flash size
                  alternatebytes: 0-0xFFFFFFFF
                  addresssize: QSPI_ADDR_8_BITS, QSPI_ADDR_16_BITS, QSPI_ADDR_24_BITS, QSPI_ADDR_32_BITS
                  alternatebytessize: QSPI_ALTE_BYTES_8_BITS, QSPI_ALTE_BYTES_16_BITS,
                                      QSPI_ALTE_BYTES_24_BITS, QSPI_ALTE_BYTES_32_BITS
                  dummycycles: between 0 and 31
                  instructionmode: QSPI_INSTRUCTION_NONE, QSPI_INSTRUCTION_1_LINE,
                                   QSPI_INSTRUCTION_2_LINES, QSPI_INSTRUCTION_4_LINES
                  addressmode: QSPI_ADDR_NONE, QSPI_ADDR_1_LINE, QSPI_ADDR_2_LINES, QSPI_ADDR_4_LINES
                  alternatebytemode: QSPI_ALTE_BYTES_NONE, QSPI_ALTE_BYTES_1_LINE,
                                     QSPI_ALTE_BYTES_2_LINES, QSPI_ALTE_BYTES_4_LINES
                  datamode: QSPI_DATA_NONE, QSPI_DATA_1_LINE, QSPI_DATA_2_LINES, QSPI_DATA_4_LINES
                  nbdata: 0-0xFFFFFFFF
                  sioomode: QSPI_SIOO_INST_EVERY_CMD, QSPI_SIOO_INST_ONLY_FIRST_CMD
    \param[in]  timeout: 0-0xFFFF
    \param[in]  toen: QSPI_TOEN_DISABLE, QSPI_TOEN_ENABLE
    \param[out] none
    \retval     none
    \note       This function may contain scenarios leading to an infinite loop.
                Modify it according to the actual usage requirements.
*/
void qspi_memorymapped(qspi_command_struct *cmd, uint16_t timeout, uint32_t toen)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(cmd)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x000DU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint16_t qtimeout = QSPI_TOMEOUT;

        while(((QSPI_CTL & QSPI_FLAG_BUSY) != 0U) && (--qtimeout > 0U)) {
        }

        /* configure QSPI: CTL register with timeout counter enable */
        QSPI_CTL = (QSPI_CTL & ~QSPI_CTL_TMOUTEN) | toen;

