burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Source/gd32w51x_f5hc_qspi.c
        if(toen == QSPI_CTL_TMOUTEN) {
            /* configure QSPI: TMOUT register with the timeout value */
            QSPI_TMOUT = timeout;
            QSPI_STATC = QSPI_STATC_TMOUTC;
            /* enable the QSPI TimeOut interrupt */
            QSPI_STAT |= QSPI_FLAG_TMOUTIE;
        }
        qspi_config(cmd, QSPI_MEMORY_MAPPED);
    }
}

/*!
    \brief      abort the current transmission. (API_ID(0x000EU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void qspi_abort(void)
{
    QSPI_CTL |= QSPI_CTL_ABORT;
}

/*!
    \brief      enable QSPI interrupt (API_ID(0x000FU))
    \param[in]  interrupt: QSPI interrupt
                only one parameter can be selected which is shown as below:
      \arg        QSPI_INT_TC: transfer complete interrupt
      \arg        QSPI_INT_FT: FIFO threshold interrupt
      \arg        QSPI_INT_TERR: transfer error interrupt
      \arg        QSPI_INT_SM: status match interrupt
      \arg        QSPI_INT_TMOUT: timeout interrupt
      \arg        QSPI_INT_WS: wrong start sequence interrupt
    \param[out] none
    \retval     none
*/
void qspi_interrupt_enable(uint8_t interrupt)
{
    switch(interrupt) {
        /* QSPI transfer complete interrupt */
        case QSPI_INT_TC:
            QSPI_STAT |= (uint32_t)QSPI_STAT_TCIE;
            break;
        /* QSPI FIFO threshold interrupt */
        case QSPI_INT_FT:
            QSPI_STAT |= (uint32_t)QSPI_STAT_FTIE;
            break;
        /* QSPI transfer error interrupt */
        case QSPI_INT_TERR:
            QSPI_STAT |= (uint32_t)QSPI_STAT_TERRIE;
            break;
        /* QSPI status match interrupt */
        case QSPI_INT_SM:
            QSPI_STAT |= (uint32_t)QSPI_STAT_SMIE;
            break;
        /* QSPI timeout interrupt */
        case QSPI_INT_TMOUT:
            QSPI_STAT |= (uint32_t)QSPI_STAT_TMOUTIE;
            break;
        /* QSPI wrong start sequence interrupt */
        case QSPI_INT_WS:
            QSPI_STAT |= (uint32_t)QSPI_STAT_WSIE;
            break;
        default:
            break;
    }
}

/*!
    \brief      disable QSPI interrupt (API_ID(0x0010U))
    \param[in]  interrupt: QSPI interrupt
                only one parameter can be selected which is shown as below:
      \arg        QSPI_INT_TC: transfer complete interrupt
      \arg        QSPI_INT_FT: FIFO threshold interrupt
      \arg        QSPI_INT_TERR: transfer error interrupt
      \arg        QSPI_INT_SM: status match interrupt
      \arg        QSPI_INT_TMOUT: timeout interrupt
      \arg        QSPI_INT_WS: wrong start sequence interrupt
    \param[out] none
    \retval     none
*/
void qspi_interrupt_disable(uint8_t interrupt)
{
    switch(interrupt) {
        /* QSPI transfer complete interrupt */
        case QSPI_INT_TC:
            QSPI_STAT &= ~(uint32_t)QSPI_STAT_TCIE;
            break;
        /* QSPI FIFO threshold interrupt */
        case QSPI_INT_FT:
            QSPI_STAT &= ~(uint32_t)QSPI_STAT_FTIE;
            break;
        /* QSPI transfer error interrupt */
        case QSPI_INT_TERR:
            QSPI_STAT &= ~(uint32_t)QSPI_STAT_TERRIE;
            break;
        /* QSPI status match interrupt */
        case QSPI_INT_SM:
            QSPI_STAT &= ~(uint32_t)QSPI_STAT_SMIE;
            break;
        /* QSPI timeout interrupt */
        case QSPI_INT_TMOUT:
            QSPI_STAT &= ~(uint32_t)QSPI_STAT_TMOUTIE;
            break;
        /* QSPI wrong start sequence interrupt */
        case QSPI_INT_WS:
            QSPI_STAT &= ~(uint32_t)QSPI_STAT_WSIE;
            break;
        default:
            break;
    }
}

/*!
    \brief      get QSPI flag status (API_ID(0x0011U))
    \param[in]  flag: QSPI flag status
                one or more parameters can be selected which are shown as below:
      \arg        QSPI_FLAG_TERR: transfer error flag
      \arg        QSPI_FLAG_TC: transfer complete flag
      \arg        QSPI_FLAG_FT: FIFO threshold flag
      \arg        QSPI_FLAG_SM: status match flag
      \arg        QSPI_FLAG_TMOUT: timeout flag
      \arg        QSPI_FLAG_WS: wrong start sequence flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus qspi_flag_get(uint32_t flag)
{
    FlagStatus reval = RESET;

    if(RESET != (QSPI_STAT & flag)) {
        reval = SET;
    }

    return reval;
}

/*!
    \brief      clear QSPI flag status (API_ID(0x0012U))
    \param[in]  flag: QSPI flag status
                one or more parameters can be selected which are shown as below:
      \arg        QSPI_FLAG_TERR: transfer error flag
      \arg        QSPI_FLAG_TC: transfer complete flag
      \arg        QSPI_FLAG_SM: status match flag
      \arg        QSPI_FLAG_TMOUT: timeout flag
      \arg        QSPI_FLAG_WS: wrong start sequence flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
void qspi_flag_clear(uint32_t flag)
{
    QSPI_STATC |= (uint32_t)flag;
}

/*!
    \brief      configure QSPI functionalmode (API_ID(0x0013U))
    \param[in]  cmd: QSPI command parameter initialization stuct members of the structure
                             and the member values are shown as below:
                  instruction: reference flash commands description
                  address: 0-flash size
                  alternatebytes: 0-0xFFFFFFFF
                  addresssize: QSPI_ADDR_8_BITS, QSPI_ADDR_16_BITS, QSPI_ADDR_24_BITS, QSPI_ADDR_32_BITS
                  alternatebytessize: QSPI_ALTE_BYTES_8_BITS, QSPI_ALTE_BYTES_16_BITS,
                                      QSPI_ALTE_BYTES_24_BITS, QSPI_ALTE_BYTES_32_BITS
                  dummycycles: between 0 and 31
                  instructionmode: QSPI_INSTRUCTION_NONE, QSPI_INSTRUCTION_1_LINE,
                                   QSPI_INSTRUCTION_2_LINES, QSPI_INSTRUCTION_4_LINES
                  addressmode: QSPI_ADDR_NONE, QSPI_ADDR_1_LINE, QSPI_ADDR_2_LINES, QSPI_ADDR_4_LINES
                  alternatebytemode: QSPI_ALTE_BYTES_NONE, QSPI_ALTE_BYTES_1_LINE,
                                     QSPI_ALTE_BYTES_2_LINES, QSPI_ALTE_BYTES_4_LINES
                  datamode: QSPI_DATA_NONE, QSPI_DATA_1_LINE, QSPI_DATA_2_LINES, QSPI_DATA_4_LINES
                  nbdata: 0-0xFFFFFFFF
                  sioomode: QSPI_SIOO_INST_EVERY_CMD, QSPI_SIOO_INST_ONLY_FIRST_CMD
    \param[in]  functionalmode: QSPI functionalmode select
                only one parameter can be selected which is shown as below:
      \arg        QSPI_INDIRECT_WRITE
      \arg        QSPI_INDIRECT_READ
      \arg        QSPI_AUTO_POLLING
      \arg        QSPI_MEMORY_MAPPED
    \param[out] none
    \retval     none
*/
static void qspi_config(qspi_command_struct *cmd, uint32_t functionalmode)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(cmd)) {
        fw_debug_report_err(QSPI_MODULE_ID, API_ID(0x0013U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if((cmd->data_mode != QSPI_DATA_NONE) && (functionalmode != QSPI_MEMORY_MAPPED)) {
            /* configure QSPI_DTLEN register with the number of data to read or write */
            QSPI_DTLEN = cmd->data_length - 1U;
        }

        if(cmd->instruction_mode != QSPI_INSTRUCTION_NONE) {
            if(cmd->altebytes_mode != QSPI_ALTE_BYTES_NONE) {
                /* configure QSPI_ALTE register with alternate bytes value */
                QSPI_ALTE = cmd->altebytes;

                if(cmd->addr_mode != QSPI_ADDR_NONE) {
                    /* command with instruction, address and alternate bytes */
                    /* configure QSPI_TCFG register with all communications parameters */
                    QSPI_TCFG = cmd->data_mode | (cmd->dummycycles << 18) | cmd->sioo_mode |
                                cmd->altebytes_size | cmd->altebytes_mode |
                                cmd->addr_size | cmd->addr_mode | cmd->instruction_mode |
                                cmd->instruction | functionalmode;

